{"key":"blondies","object":{"ingrediants":{"baking powder":"1 tsp","chopped pecans":"¾ cup (180 g)","egg":1,"firmly packed dark brown sugar":"1 cup (240 g)","flour":"1 cup (125 g)","melted unsalted butter":"cup (120 g)","salt":"¾ tsp","vanilla extract":"1 tbsp"},"key":"blondies","name":"Blondies","notes":"","procedure":"1. Preheat oven to 325°F (170°C).\n2. Dry toast the chopped pecans until fragrant and slightly colored. This can either be done in a dry skillet on the stovetop over medium-high heat while stirring frequently or else by roasting the nuts in the oven on a cookie sheet while you prepare the batter. The stovetop method is faster but requires more attention. It is also possible to buy dry toasted nuts instead of raw to avoid this step. The pecans should be crunchy and nutty, not rubbery or mealy.\n3. In a small bowl stir together the flour, baking powder, and salt. Set aside.\n4. In a large bowl, stir the melted butter, brown sugar, and vanilla until uniform, breaking up any large lumps of sugar.\n5. Beat in egg until creamy.\n6. Gently fold in flour mixture. When flour is nearly incorporated, gently fold in toasted pecans. Do not overmix.\n7. Spread mixture into buttered 8 x 8-inch (20 x 20 cm) baking dish.\n8. Bake at 325°F (170°C) for 30 minutes or until desired doneness.\n9. Let cool and cut into bars.\n","url":"https://en.wikibooks.org/wiki/Cookbook:Pecan_Blondies"}}
{"key":"brownies","object":{"ingrediants":{"all-purpose flour":"½ cup","eggs":2,"light brown sugar":"1 cup packed","softened butter or margarine":"½ cup (1 stick)","unsweetened chocolate, melted":"2 ounces (2 squares)"},"key":"brownies","name":"Brown Sugar Brownies","notes":"The brownies can also be baked in a Dutch oven at moderately slow heat instead of in the baking pan.","procedure":"1. Preheat oven to 325°F. 2. Grease an 8 x 8 x 2-inch square baking pan. 3. Cream sugar and butter until fluffy. 4. Beat in eggs. 5. Beat in melted chocolate. 6. Mix in flour, then stir in nuts. 7. Pour into prepared pan. 8. Bake about 25 minutes. 9. Cool in pan, and cut into squares.","url":""}}
{"key":"frybread","object":{"ingrediants":{"backing powder":"2 tsp","flour":"2 cups","hot water":"⅔ cups","salt":"1 tsp salt","shortening":"2 Tbsp"},"key":"frybread","name":"Fry Bread","notes":"- You can substitute either ¼ cup plain yogurt, or a ¼ cup soured milk as a leavening agent instead of baking powder. If you do, add 2 hours to the rest time for the dough, and leave the dough somewhere warm. You can optionally include the baking powder as well to get a very puffy version of frybread. If using yogurt or soured milk for leavening, use ½ cup instead of ⅓ cup water.\n- You can use mayonnaise in place of shortening for a crispy, crunchier texture.\n- You can also fry the dough in hot oil over a stovetop. The dough cooks rapidly and will brown in about 12 seconds and must be turned over to allow the opposite side to brown, then be removed from the oil and placed sideways into a colander or large bowl lined with paper towels to allow the oil to drain off the finished product\n","procedure":"1. Combine flour, baking powder, and salt in a bowl.\n2. Use a pastry blender (or two butter knives) to cut the shortening into the flour.\n3. Add the hot water, and mix until the water is incorporated and you get a dough.\n4. Turn out the dough on a lightly floured board. Knead the dough until it is soft and smooth.\n5. Wrap the dough in plastic, and let the dough rest for 30 minutes.\n6. Divide the dough into 6 pieces, roll each into a ball, and roll each into a flat disk with a rolling pin.\n7. Brush one side of each disk with melted margarine and place on a barbecue over a 3 Mississippi fire.\n8. Brush the opposing side of the bread with margarine and flip the bread on the barbecue.\n9. Cook until both sides are golden brown. Serve hot.\n","url":"https://en.wikibooks.org/wiki/Cookbook:Fry_Bread_I"}}
{"key":"waffles","object":{"ingrediants":{"baking powder":"1 tablespoon","eggs, separated":2,"flour":"1¾ cups (420 ml)","milk":"1½ cups (360 ml)","salt":"1 teaspoon","vegetable oil":"½ cup (120 ml)","white granulated sugar":"1 tablespoon"},"name":"Waffles","notes":"Spread ¾ cup (180 ml) batter, then quickly cover surface of batter with thinly sliced apples. Close cover and cook as usual.\n","procedure":"1. Lightly brush grids of waffle iron with oil, close waffle iron, and preheat according to manufacturer's directions.\n2. In small bowl, beat egg whites until stiff (but not dry) and set aside.\n3. In large bowl, beat egg yolks until thick and lemon-colored.\n4. Continue beating, adding milk and oil.\n5. Add dry ingredients, beat until smooth, and fold in egg whites.\n6. Pour 1 cup (240 ml) of batter on heated grid, close unit and cook according to manufacturer's directions.\",\n","url":"https://en.wikibooks.org/wiki/Cookbook:Waffles", "key": "waffles"}}

