{"key":"blondies","object":{"ingredients":"baking powder,1 tsp\r\nchopped pecans,¾ cup (180 g)\r\negg,1\r\nfirmly packed dark brown sugar,1 cup (240 g)\r\nflour,1 cup (125 g)\r\nmelted unsalted butter,cup (120 g)\r\nsalt,¾ tsp\r\nvanilla extract,1 tbsp\r\n","key":"blondies","name":"Blondies","procedure":"1. Preheat oven to 325°F (170°C).\r\n2. Dry toast the chopped pecans until fragrant and slightly colored.\r\nThis can either be done in a dry skillet on the stovetop over medium-high heat\r\nwhile stirring frequently or else by roasting the nuts in the oven on a\r\ncookie sheet while you prepare the batter. The stovetop method is faster but\r\nrequires more attention. It is also possible to buy dry toasted nuts instead of\r\nraw to avoid this step. The pecans should be crunchy and nutty, not rubbery or mealy.\r\n3. In a small bowl stir together the flour, baking powder, and salt. Set aside.\r\n4. In a large bowl, stir the melted butter, brown sugar, and vanilla until uniform,\r\nbreaking up any large lumps of sugar.\r\n5. Beat in egg until creamy.\r\n6. Gently fold in flour mixture. When flour is nearly incorporated, gently fold in\r\ntoasted pecans. Do not overmix.\r\n7. Spread mixture into buttered 8 x 8-inch (20 x 20 cm) baking dish.\r\n8. Bake at 325°F (170°C) for 30 minutes or until desired doneness.\r\n9. Let cool and cut into bars.\r\n","save":""}}
{"key":"brownies","object":{"ingredients":"ingredient,units\r\nall-purpose flour,½ cup\r\neggs,2\r\nlight brown sugar,1 cup packed\r\nsoftened butter or margarine,½ cup (1 stick)\r\n\"unsweetened chocolate, melted\",\"2 ounces (2 squares)\"\r\n","key":"brownies","name":"Brown Sugar Brownies","procedure":"1. Preheat oven to 325°F.\r\n2. Grease an 8 x 8 x 2-inch square baking pan.\r\n3. Cream sugar and butter until fluffy.\r\n4. Beat in eggs.\r\n5. Beat in melted chocolate.\r\n6. Mix in flour, then stir in nuts.\r\n7. Pour into prepared pan.\r\n8. Bake about 25 minutes.\r\n9. Cool in pan, and cut into squares.","save":"Save","url":""}}
{"key":"cafe-con-leche","object":{"ingredients":"Ingredients,Units\r\nFiltered water,fill to 8 on coffee pot\r\nFinely-ground Cuban coffee,3 Tbsp\r\nheated whole milk, 8 ounces\r\n","key":"cafe-con-leche","name":"Cafe con Leche","procedure":"1. Prepare the coffee in drip maker by filling the coffee pot to number 8, and pour 3 Tbsp of ground Cuban express coffee into filter. Press \"brew\"\r\n\r\n2. While brewing, pour the 8 ounces of milk into the electric milk frothier (max  line). Put on the lid and flip the switch to froth.\r\n\r\n3. When coffee has finished brewing, set out two glass coffee mugs, fill from, 1/2 to 2/3 full with coffee.\r\n\r\n4. When frothier completes, top off glass mugs with heated milk and serve.\r\n\r\nEquipment:\r\n\r\n- Coffee or expresso maker\r\n- Milk Frother (stand alone or the steamer on an expresso machihne)\r\n- Carafe/Coffee pot\r\n- Coffee cups\r\n- Coffee grinder if you have whole beans\r\n","save":""}}
{"key":"frybread","object":{"ingredients":"backing powder,2 tsp\r\nflour,2 cups\r\nhot water,⅔ cups\r\nsalt,1 tsp salt\r\nshortening,2 Tbsp\r\n","key":"frybread","name":"Fry Bread","procedure":"1. Combine flour, baking powder, and salt in a bowl.\r\n2. Use a pastry blender (or two butter knives) to cut the shortening into the flour.\r\n3. Add the hot water, and mix until the water is incorporated and you get a dough.\r\n4. Turn out the dough on a lightly floured board. Knead the dough until it is soft and smooth.\r\n5. Wrap the dough in plastic, and let the dough rest for 30 minutes.\r\n6. Divide the dough into 6 pieces, roll each into a ball, and roll each into a flat disk with a rolling pin.\r\n7. Brush one side of each disk with melted margarine and place on a barbecue over a 3 Mississippi fire.\r\n8. Brush the opposing side of the bread with margarine and flip the bread on the barbecue.\r\n9. Cook until both sides are golden brown. Serve hot.\r\n\r\n- You can substitute either ¼ cup plain yogurt, or a ¼ cup soured milk as a leavening agent\r\ninstead of baking powder. If you do, add 2 hours to the rest time for the dough, and leave\r\nthe dough somewhere warm. You can optionally include the baking powder as well to get a\r\nvery puffy version of frybread. If using yogurt or soured milk for leavening, use ½ cup\r\ninstead of ⅓ cup water.\r\n- You can use mayonnaise in place of shortening for a crispy, crunchier texture.\r\n- You can also fry the dough in hot oil over a stovetop. The dough cooks rapidly and will brown\r\nin about 12 seconds and must be turned over to allow the opposite side to brown, then be removed\r\nfrom the oil and placed sideways into a colander or large bowl lined with paper towels to allow\r\nthe oil to drain off the finished product\r\n\r\nurl: https://en.wikibooks.org/wiki/Cookbook:Fry_Bread_I\r\n","save":""}}
{"key":"poi","object":{"ingredients":"Ingredients,Units\r\nTaro, 1 to 2\r\nWater\r\n","key":"poi","name":"poi","procedure":"Steps:\r\n\r\n1. Use a vegetable brush to scrub the taro root under cold, running water. Do not peel.\r\n2. In a large pot, cover taro with cold water and bring to a boil. Reduce heat to simmer and cook until taro can be pierced easily with a fork. Drain and rinse with cold water.\r\n3. Peel the cooked taro and cut into small pieces. Using 2 cups at a time, put the cooked taro into a food processor bowl.\r\n4. Add a tablespoon of water and process until smooth. The consistency should be sticky and thick enough to stick to one finger. (Adding more water will produce “three finger poi”.)\r\n5. Rinse a non-reactive bowl (typically made of silicone or stainless steel) with cold water and transfer the mixture to the bowl. Slowly pour a thin layer of cool water on top of the poi and cover the bowl with a clean kitchen towel.\r\n6. Allow the mixture to sit at a cool room temperature for 2-4 days. (optional, this step allows the poi to ferment and become sour)\r\n\r\nMaterials & Equipment:\r\n\r\n- vegetable brush\r\n- 2 quart pot\r\n- food processor\r\n- medium-sized silicone or stainless steel mixing bowl\r\n\r\nRecipe from <https://heleloa.com/poi/>\r\n","save":""}}
{"key":"waffles","object":{"ingredients":"Ingredients,Units\r\nbaking powder,1 tablespoon\r\n\"eggs, separated\",\"2\"\r\nflour,1¾ cups (420 ml)\r\nmilk,1½ cups (360 ml)\r\nsalt,1 teaspoon\r\nvegetable oil,½ cup (120 ml)\r\nwhite granulated sugar,1 tablespoon\r\n","key":"waffles","name":"Waffles","procedure":"1. Lightly brush grids of waffle iron with oil, close waffle iron, and preheat according to manufacturer's directions.\r\n2. In small bowl, beat egg whites until stiff (but not dry) and set aside.\r\n3. In large bowl, beat egg yolks until thick and lemon-colored.\r\n4. Continue beating, adding milk and oil.\\n5. Add dry ingredients, beat until smooth, and fold in egg whites.\r\n6. Pour 1 cup (240 ml) of batter on heated grid, close unit and cook according to manufacturer's directions.\r\n\r\nSpread ¾ cup (180 ml) batter, then quickly cover surface of batter with thinly sliced apples. Close cover and cook as usual.\\n\",\r\n\r\nRecipe url: https://en.wikibooks.org/wiki/Cookbook:Waffles\r\n\r\n","save":""}}
